#2.3题，通过Cox-staut法检验数据的趋势性质
chs<-c(17.3,17.9,18.4,18.1,18.3,19.6,18.6,19.2,17.7,20.0,19.0,18.8,19.3,20.2,19.9);
lchs<-length(chs);
#已知共有15个数据，则应该在数组中增补第16个数据于第7个数据之后
#增补的数据与第七个数据相同
chs1<-c(17.3,17.9,18.4,18.1,18.3,19.6,18.6,19.2,19.2,17.7,20.0,19.0,18.8,19.3,20.2,19.9);
lchs1<-length(chs1);
sf=0;sz=0;
for (i in 1:7) {
  panduan<-chs1[i]-chs1[i+9];
  #求取S-的值
  if(panduan<0){
    sf=sf+1;
  };
  #求取S+的值
  if(panduan>0){
    sz=sz+1;
  };
  
}
K=min(sf,sz);
#假设H0：该城市死亡率有逐年上升的趋势，则有备择假设为H1：其没有上升的趋势
#此时有P值为
p=1/2^15;
#P值远小于显著性质数0.05
#认为这个时候接受原假设，既这15年死亡率有上升的趋势 